# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'
baby_names = pd.read_csv(url)

In [3]:
baby_names[:5]

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

In [10]:
baby_names.shape
baby_names.info()
baby_names.describe(include='all')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1016395 entries, 0 to 1016394
Data columns (total 7 columns):
Unnamed: 0    1016395 non-null int64
Id            1016395 non-null int64
Name          1016395 non-null object
Year          1016395 non-null int64
Gender        1016395 non-null object
State         1016395 non-null object
Count         1016395 non-null int64
dtypes: int64(4), object(3)
memory usage: 54.3+ MB

,Unnamed: 0,Id,Name,Year,Gender,State,Count
count,1.016395e+06,1.016395e+06,1016395,1.016395e+06,1016395,1016395,1.016395e+06
unique,NaN,NaN,17632,NaN,2,51,NaN
top,NaN,NaN,Riley,NaN,F,CA,NaN
freq,NaN,NaN,1112,NaN,558846,76781,NaN
mean,2.830990e+06,2.830991e+06,NaN,2.009053e+03,NaN,NaN,3.485012e+01
std,1.652476e+06,1.652476e+06,NaN,3.138293e+00,NaN,NaN,9.739735e+01
min,1.134900e+04,1.135000e+04,NaN,2.004000e+03,NaN,NaN,5.000000e+00
25%,1.317326e+06,1.317328e+06,NaN,2.006000e+03,NaN,NaN,7.000000e+00
50%,2.811920e+06,2.811921e+06,NaN,2.009000e+03,NaN,NaN,1.100000e+01
75%,4.242554e+06,4.242556e+06,NaN,2.012000e+03,NaN,NaN,2.600000e+01
max,5.647425e+06,5.647426e+06,NaN,2.014000e+03,NaN,NaN,4.167000e+03

In [22]:
baby_names.columns

# SO FAST!
# %timeit baby_names.Name.value_counts

%timeit baby_names.Name.value_counts(ascending=False)[:10]

baby_names.Name.value_counts(ascending=False)[:10]

239 ms ± 8.63 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)

Riley     1112
Avery     1080
Jordan    1073
Peyton    1064
Hayden    1049
Taylor    1033
Jayden    1031
Alexis     984
Payton     971
Angel      962
Name: Name, dtype: int64

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [24]:
%timeit baby_names.drop(['Unnamed: 0', 'Id'], axis=1)

49.5 ms ± 277 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [25]:
%timeit baby_names.loc[:, "Name":]

49.5 ms ± 373 µs per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [26]:
baby_names.drop(['Unnamed: 0', 'Id'], axis=1, inplace=True)

### Step 6. Is there more male or female names in the dataset?

In [78]:
baby_names.head()

# %timeit baby_names.groupby('Gender').Name.count()

baby_names.groupby('Gender').Name.count()

# There answer below was what they went for which is how many male
# vs female names there are

baby_names['Gender'].value_counts('F')
# baby_names.groupby('Name').Gender.value_counts().count()

18941

### Step 7. Group the dataset by name and assign to names

In [74]:
# Hmm?
baby_names.assign

# Oh, they wanted a new dataframe

names = baby_names.groupby("Name").sum()

names.head()

         Count
Name
Aaban       12
Aadan       23
Aadarsh      5
Aaden     3426
Aadhav       6

### Step 8. How many different names exist in the dataset?

In [80]:
baby_names.Name.value_counts().count()

# baby_names.shape

# But because they made the new df I can do this
names.shape

(17632, 1)

### Step 9. What is the name with most occurrences?

In [87]:
baby_names.Name.value_counts()[:1]

# It's occurences by the sum of Count, not count of rows

names.Count.describe()

names.Count.idxmax()

names[names.Count == names.Count.max()]

        Count
Name
Jacob  242874

### Step 10. How many different names have the least occurrences?

In [89]:
baby_names.Name.value_counts().tail()

len(baby_names.Name.value_counts()[baby_names.Name.value_counts() == 1])

# Close but wrong, should have done this

len(names[names.Count == names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [52]:
baby_names.Name.value_counts().median()

8.0

In [59]:
# Sick this works
baby_names.Name.value_counts()[baby_names.Name.value_counts() == 8][:5]

Gaelle      8
Marwan      8
Princesa    8
Ranveer     8
Polly       8
Name: Name, dtype: int64

In [91]:
# Wanted the median by Count not occurence of Name

names[names.Count == names.Count.median()][:5]

         Count
Name
Aishani     49
Alara       49
Alysse      49
Ameir       49
Anely       49

### Step 12. What is the standard deviation of names?

In [70]:
baby_names.Name.value_counts().std()

122.02996350814088

In [97]:
baby_names.Name.value_counts().describe()

# 

names.Count.std()

11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [96]:
baby_names.describe(include='all')

# Had it wrong because of count of occurences not sum of Count

# baby_names.groupby('Name').Count.describe()

# Hahah, the above blew the lid off things because it did it for each name

names.describe()

# same as

baby_names.groupby('Name').sum().describe()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000